<a href="https://colab.research.google.com/github/tasanyphy01773/DS_and_ML/blob/main/DS_and_ML_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np 
import pandas as pd

In [3]:
Age = pd.Series([22,24,21,19], index=['age1', 'age2', 'age3', 'age4'])
Age

age1    22
age2    24
age3    21
age4    19
dtype: int64

In [5]:
DF = np.array([[1,2,3],[4,2,1],[9,4,3],[3,1,5]])
Data_set = pd.DataFrame(DF)
Data_set

   0  1  2
0  1  2  3
1  4  2  1
2  9  4  3
3  3  1  5

In [6]:
Data_set = pd.DataFrame(DF, index = ['S1', 'S2', 'S3', 'S4'], 
                        columns=('PHY', 'CHEM', 'MATH'))

Data_set['BIO'] = [2,0,1,1]

Data_set.loc['S3', 'PHY']

Data_set.iloc[0,2]

Data_set.sort_values('PHY', ascending=True)

Data_set.sort_index(axis=0, ascending=True)

    PHY  CHEM  MATH  BIO
S1    1     2     3    2
S2    4     2     1    0
S3    9     4     3    1
S4    3     1     5    1